renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/8. CAN driver/Examples/CAN_Example1_Polling_Loop_Back_Mode/Autosar/Mcal/Base/header/S32K116_M0P.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FTFC</name>
      <description>FTFC</description>
      <groupName>FTFC</groupName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FSTAT</name>
          <description>Flash Status Register</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>MGSTAT0</name>
              <description>Memory Controller Command Completion Status Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FPVIOL</name>
              <description>Flash Protection Violation Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FPVIOL_0</name>
                  <description>No protection violation detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FPVIOL_1</name>
                  <description>Protection violation detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCERR</name>
              <description>Flash Access Error Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCERR_0</name>
                  <description>No access error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCERR_1</name>
                  <description>Access error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDCOLERR</name>
              <description>FTFC Read Collision Error Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RDCOLERR_0</name>
                  <description>No collision error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDCOLERR_1</name>
                  <description>Collision error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCIF</name>
              <description>Command Complete Interrupt Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIF_0</name>
                  <description>FTFC command or emulated EEPROM file system operation in progress</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIF_1</name>
                  <description>FTFC command or emulated EEPROM file system operation has completed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCNFG</name>
          <description>Flash Configuration Register</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>EEERDY</name>
              <description>EEERDY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EEERDY_0</name>
                  <description>FlexRAM is not available for emulated EEPROM operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEERDY_1</name>
                  <description>FlexRAM is available for EEPROM operations where: (1) reads from the FlexRAM return data previously written to the FlexRAM in emulated EEPROM mode and (2) writes launch an EEPROM operation to store the written data in the FlexRAM and EEPROM backup.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMRDY</name>
              <description>RAM Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAMRDY_0</name>
                  <description>FlexRAM is not available for traditional RAM access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAMRDY_1</name>
                  <description>FlexRAM is available as traditional RAM only; writes to the FlexRAM do not trigger EEPROM operations</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERSSUSP</name>
              <description>Erase Suspend</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERSSUSP_0</name>
                  <description>No suspend requested</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERSSUSP_1</name>
                  <description>Suspend the current Erase Flash Sector command execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERSAREQ</name>
              <description>Erase All Request</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERSAREQ_0</name>
                  <description>No request or request complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERSAREQ_1</name>
                  <description>Request to: (1) run the Erase All Blocks command, (2) verify the erased state, (3) program the security byte in the Flash Configuration Field to the unsecure state, and (4) release MCU security by setting the FSEC[SEC] field to the unsecure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDCOLLIE</name>
              <description>Read Collision Error Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RDCOLLIE_0</name>
                  <description>Read collision error interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDCOLLIE_1</name>
                  <description>Read collision error interrupt enabled. An interrupt request is generated whenever an FTFC read collision error is detected (see the description of FSTAT[RDCOLERR]).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCIE</name>
              <description>Command Complete Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIE_0</name>
                  <description>Command complete interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIE_1</name>
                  <description>Command complete interrupt enabled. An interrupt request is generated whenever the FSTAT[CCIF] flag is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FSEC</name>
          <description>Flash Security Register</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SEC</name>
              <description>Flash Security</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEC_0</name>
                  <description>MCU security status is secure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC_1</name>
                  <description>MCU security status is secure</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC_2</name>
                  <description>MCU security status is unsecure (The standard shipping condition of the FTFC is unsecure.)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC_3</name>
                  <description>MCU security status is secure</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSLACC</name>
              <description>Factory Failure Analysis Access Code</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSLACC_0</name>
                  <description>Factory access granted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSLACC_1</name>
                  <description>Factory access denied</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSLACC_2</name>
                  <description>Factory access denied</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSLACC_3</name>
                  <description>Factory access granted</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEEN</name>
              <description>Mass Erase Enable Bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEEN_0</name>
                  <description>Mass erase is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEEN_1</name>
                  <description>Mass erase is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEEN_2</name>
                  <description>Mass erase is disabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEEN_3</name>
                  <description>Mass erase is enabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEYEN</name>
              <description>Backdoor Key Security Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEYEN_0</name>
                  <description>Backdoor key access disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEYEN_1</name>
                  <description>Backdoor key access disabled (preferred KEYEN state to disable backdoor key access)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEYEN_2</name>
                  <description>Backdoor key access enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEYEN_3</name>
                  <description>Backdoor key access disabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FOPT</name>
          <description>Flash Option Register</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OPT</name>
              <description>Nonvolatile Option</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>12</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimIndex>3,2,1,0,7,6,5,4,B,A,9,8</dimIndex>
          <name>FCCOB%s</name>
          <description>Flash Common Command Object Registers</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CCOBn</name>
              <description>CCOBn</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimIndex>3,2,1,0</dimIndex>
          <name>FPROT%s</name>
          <description>Program Flash Protection Registers</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PROT</name>
              <description>Program Flash Region Protect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEPROT</name>
          <description>EEPROM Protection Register</description>
          <addressOffset>0x16</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>EPROT</name>
              <description>EEPROM Region Protect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPROT_0</name>
                  <description>EEPROM region is protected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPROT_1</name>
                  <description>EEPROM region is not protected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FDPROT</name>
          <description>Data Flash Protection Register</description>
          <addressOffset>0x17</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DPROT</name>
              <description>Data Flash Region Protect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPROT_0</name>
                  <description>Data Flash region is protected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPROT_1</name>
                  <description>Data Flash region is not protected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
