renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/8. CAN driver/Examples/CAN_Example1_Polling_Loop_Back_Mode/Autosar/Mcal/Base/header/S32K116_M0P.svd
        <register>
          <name>SYNC</name>
          <description>Synchronization</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNTMIN</name>
              <description>Minimum Loading Point Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNTMIN_0</name>
                  <description>The minimum loading point is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNTMIN_1</name>
                  <description>The minimum loading point is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNTMAX</name>
              <description>Maximum Loading Point Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNTMAX_0</name>
                  <description>The maximum loading point is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNTMAX_1</name>
                  <description>The maximum loading point is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REINIT</name>
              <description>FTM Counter Reinitialization by Synchronization</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REINIT_0</name>
                  <description>FTM counter continues to count normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REINIT_1</name>
                  <description>FTM counter is updated with its initial value when the selected trigger is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCHOM</name>
              <description>Output Mask Synchronization</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCHOM_0</name>
                  <description>OUTMASK register is updated with the value of its buffer in all rising edges of the FTM input clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCHOM_1</name>
                  <description>OUTMASK register is updated with the value of its buffer only by the PWM synchronization.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG0</name>
              <description>PWM Synchronization Hardware Trigger 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG0_0</name>
                  <description>Trigger is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG0_1</name>
                  <description>Trigger is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG1</name>
              <description>PWM Synchronization Hardware Trigger 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG1_0</name>
                  <description>Trigger is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG1_1</name>
                  <description>Trigger is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG2</name>
              <description>PWM Synchronization Hardware Trigger 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG2_0</name>
                  <description>Trigger is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG2_1</name>
                  <description>Trigger is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWSYNC</name>
              <description>PWM Synchronization Software Trigger</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWSYNC_0</name>
                  <description>Software trigger is not selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWSYNC_1</name>
                  <description>Software trigger is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTINIT</name>
          <description>Initial State For Channels Output</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0OI</name>
              <description>Channel 0 Output Initialization Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0OI_0</name>
                  <description>The initialization value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0OI_1</name>
                  <description>The initialization value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1OI</name>
              <description>Channel 1 Output Initialization Value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH1OI_0</name>
                  <description>The initialization value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1OI_1</name>
                  <description>The initialization value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH2OI</name>
              <description>Channel 2 Output Initialization Value</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH2OI_0</name>
                  <description>The initialization value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2OI_1</name>
                  <description>The initialization value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH3OI</name>
              <description>Channel 3 Output Initialization Value</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH3OI_0</name>
                  <description>The initialization value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3OI_1</name>
                  <description>The initialization value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH4OI</name>
              <description>Channel 4 Output Initialization Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH4OI_0</name>
                  <description>The initialization value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH4OI_1</name>
                  <description>The initialization value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH5OI</name>
              <description>Channel 5 Output Initialization Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH5OI_0</name>
                  <description>The initialization value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH5OI_1</name>
                  <description>The initialization value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH6OI</name>
              <description>Channel 6 Output Initialization Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH6OI_0</name>
                  <description>The initialization value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH6OI_1</name>
                  <description>The initialization value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH7OI</name>
              <description>Channel 7 Output Initialization Value</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH7OI_0</name>
                  <description>The initialization value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH7OI_1</name>
                  <description>The initialization value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTMASK</name>
          <description>Output Mask</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0OM</name>
              <description>Channel 0 Output Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0OM_0</name>
                  <description>Channel output is not masked. It continues to operate normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0OM_1</name>
                  <description>Channel output is masked. It is forced to its inactive state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1OM</name>
              <description>Channel 1 Output Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH1OM_0</name>
                  <description>Channel output is not masked. It continues to operate normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1OM_1</name>
                  <description>Channel output is masked. It is forced to its inactive state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH2OM</name>
              <description>Channel 2 Output Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH2OM_0</name>
                  <description>Channel output is not masked. It continues to operate normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2OM_1</name>
                  <description>Channel output is masked. It is forced to its inactive state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH3OM</name>
              <description>Channel 3 Output Mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH3OM_0</name>
                  <description>Channel output is not masked. It continues to operate normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3OM_1</name>
                  <description>Channel output is masked. It is forced to its inactive state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH4OM</name>
              <description>Channel 4 Output Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH4OM_0</name>
                  <description>Channel output is not masked. It continues to operate normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH4OM_1</name>
                  <description>Channel output is masked. It is forced to its inactive state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH5OM</name>
              <description>Channel 5 Output Mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH5OM_0</name>
                  <description>Channel output is not masked. It continues to operate normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH5OM_1</name>
                  <description>Channel output is masked. It is forced to its inactive state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH6OM</name>
              <description>Channel 6 Output Mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH6OM_0</name>
                  <description>Channel output is not masked. It continues to operate normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH6OM_1</name>
                  <description>Channel output is masked. It is forced to its inactive state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH7OM</name>
              <description>Channel 7 Output Mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH7OM_0</name>
                  <description>Channel output is not masked. It continues to operate normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH7OM_1</name>
                  <description>Channel output is masked. It is forced to its inactive state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
