renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/8. CAN driver/Examples/CAN_Example1_Polling_Loop_Back_Mode/Autosar/Mcal/Base/header/S32K116_M0P.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SIM</name>
      <description>SIM</description>
      <groupName>SIM</groupName>
      <baseAddress>0x40048000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x70</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CHIPCTL</name>
          <description>Chip Control register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x300000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLKOUTSEL</name>
              <description>CLKOUT Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKOUTSEL_0</name>
                  <description>SCG CLKOUT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_2</name>
                  <description>SOSC DIV2 CLK</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_4</name>
                  <description>SIRC DIV2 CLK</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_5</name>
                  <description>For S32K148: QSPI_SFIF_CLK_HYP_PREMUX: Divide by 2 clock (configured through SCLKCONFIG[5]) for HyperRAM going to sfif clock to QSPI; For others: Reserved</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_6</name>
                  <description>FIRC DIV2 CLK</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_7</name>
                  <description>HCLK</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_8</name>
                  <description>For S32K14x: SPLL DIV2 CLK For S32K11x: Reserved</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_9</name>
                  <description>BUS_CLK</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_10</name>
                  <description>LPO128K_CLK</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_11</name>
                  <description>For S32K148: QSPI_Module clock; For others: Reserved</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_12</name>
                  <description>LPO_CLK as selected by SIM_LPOCLKS[LPOCLKSEL]</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_13</name>
                  <description>For S32K148: QSPI_SFIF_CLK; For others: Reserved</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_14</name>
                  <description>RTC_CLK as selected by SIM_LPOCLKS[RTCCLKSEL]</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_15</name>
                  <description>For S32K148: QSPI_2xSFIF_CLK; For others: Reserved</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTDIV</name>
              <description>CLKOUT Divide Ratio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKOUTDIV_0</name>
                  <description>Divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTDIV_1</name>
                  <description>Divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTDIV_2</name>
                  <description>Divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTDIV_3</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTDIV_4</name>
                  <description>Divide by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTDIV_5</name>
                  <description>Divide by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTDIV_6</name>
                  <description>Divide by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTDIV_7</name>
                  <description>Divide by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTEN</name>
              <description>CLKOUT enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKOUTEN_0</name>
                  <description>Clockout disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTEN_1</name>
                  <description>Clockout enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_SUPPLY</name>
              <description>ADC_SUPPLY</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_SUPPLY_0</name>
                  <description>5 V input VDD supply (VDD)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SUPPLY_1</name>
                  <description>5 V input analog supply (VDDA)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SUPPLY_2</name>
                  <description>ADC Reference Supply (VREFH)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SUPPLY_3</name>
                  <description>3.3 V Oscillator Regulator Output (VDD_3V)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SUPPLY_4</name>
                  <description>3.3 V flash regulator output (VDD_flash_3V)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SUPPLY_5</name>
                  <description>1.2 V core regulator output (VDD_LV)</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_SUPPLYEN</name>
              <description>ADC_SUPPLYEN</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_SUPPLYEN_0</name>
                  <description>Disable internal supply monitoring</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SUPPLYEN_1</name>
                  <description>Enable internal supply monitoring</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMU_RETEN</name>
              <description>SRAMU_RETEN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAMU_RETEN_0</name>
                  <description>SRAMU contents are retained across resets</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAMU_RETEN_1</name>
                  <description>No SRAMU retention</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAML_RETEN</name>
              <description>SRAML_RETEN</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAML_RETEN_0</name>
                  <description>SRAML contents are retained across resets</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAML_RETEN_1</name>
                  <description>No SRAML retention</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FTMOPT0</name>
          <description>FTM Option Register 0</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FTM0FLTxSEL</name>
              <description>FTM0 Fault X Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTM0FLTxSEL_0</name>
                  <description>FTM0_FLTx pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM0FLTxSEL_1</name>
                  <description>TRGMUX_FTM0 out</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM1FLTxSEL</name>
              <description>FTM1 Fault X Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTM1FLTxSEL_0</name>
                  <description>FTM1_FLTx pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM1FLTxSEL_1</name>
                  <description>TRGMUX_FTM1 out</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM0CLKSEL</name>
              <description>FTM0 External Clock Pin Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTM0CLKSEL_0</name>
                  <description>FTM0 external clock driven by TCLK0 pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM0CLKSEL_1</name>
                  <description>FTM0 external clock driven by TCLK1 pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM0CLKSEL_2</name>
                  <description>FTM0 external clock driven by TCLK2 pin.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM0CLKSEL_3</name>
                  <description>No clock input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM1CLKSEL</name>
              <description>FTM1 External Clock Pin Select</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTM1CLKSEL_0</name>
                  <description>FTM1 external clock driven by TCLK0 pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM1CLKSEL_1</name>
                  <description>FTM1 external clock driven by TCLK1 pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM1CLKSEL_2</name>
                  <description>FTM1 external clock driven by TCLK2 pin.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM1CLKSEL_3</name>
                  <description>No clock input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPOCLKS</name>
          <description>LPO Clock Select Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPO1KCLKEN</name>
              <description>1 kHz LPO_CLK enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPO1KCLKEN_0</name>
                  <description>Disable 1 kHz LPO_CLK output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPO1KCLKEN_1</name>
                  <description>Enable 1 kHz LPO_CLK output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPO32KCLKEN</name>
              <description>32 kHz LPO_CLK enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPO32KCLKEN_0</name>
                  <description>Disable 32 kHz LPO_CLK output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPO32KCLKEN_1</name>
                  <description>Enable 32 kHz LPO_CLK output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPOCLKSEL</name>
              <description>LPO clock source select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPOCLKSEL_0</name>
                  <description>128 kHz LPO_CLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPOCLKSEL_1</name>
                  <description>No clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPOCLKSEL_2</name>
                  <description>32 kHz LPO_CLK which is derived from the 128 kHz LPO_CLK</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPOCLKSEL_3</name>
                  <description>1 kHz LPO_CLK which is derived from the 128 kHz LPO_CLK</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCCLKSEL</name>
              <description>32 kHz clock source select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCCLKSEL_0</name>
                  <description>SOSCDIV1_CLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCCLKSEL_1</name>
                  <description>32 kHz LPO_CLK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCCLKSEL_2</name>
                  <description>32 kHz RTC_CLKIN clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCCLKSEL_3</name>
                  <description>FIRCDIV1_CLK</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCOPT</name>
          <description>ADC Options Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC0TRGSEL</name>
              <description>ADC0 trigger source select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC0TRGSEL_0</name>
                  <description>PDB output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0TRGSEL_1</name>
                  <description>TRGMUX output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC0SWPRETRG</name>
              <description>ADC0 software pretrigger sources</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC0SWPRETRG_0</name>
                  <description>Software pretrigger disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0SWPRETRG_4</name>
                  <description>Software pretrigger 0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0SWPRETRG_5</name>
                  <description>Software pretrigger 1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0SWPRETRG_6</name>
                  <description>Software pretrigger 2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0SWPRETRG_7</name>
                  <description>Software pretrigger 3</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC0PRETRGSEL</name>
              <description>ADC0 pretrigger source select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC0PRETRGSEL_0</name>
                  <description>PDB pretrigger (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0PRETRGSEL_1</name>
                  <description>TRGMUX pretrigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0PRETRGSEL_2</name>
                  <description>Software pretrigger</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
